In [23]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

In [43]:
df = pd.read_csv('Car_Purchasing_Data.csv', encoding='ISO-8859-1')
df

,Customer Name,Customer e-mail,Country,Gender,Age,Annual Salary,Credit Card Debt,Net Worth,Car Purchase Amount
0,Martina Avila,cubilia.Curae.Phasellus@quisaccumsanconvallis.edu,Bulgaria,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,Harlan Barnes,eu.dolor@diam.co.uk,Belize,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,Naomi Rodriquez,vulputate.mauris.sagittis@ametconsectetueradip...,Algeria,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,Jade Cunningham,malesuada@dignissim.com,Cook Islands,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,Cedric Leach,felis.ullamcorper.viverra@egetmollislectus.net,Brazil,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248
...,...,...,...,...,...,...,...,...,...
495,Walter,ligula@Cumsociis.ca,Nepal,0,41.462515,71942.40291,6995.902524,541670.1016,48901.44342
496,Vanna,Cum.sociis.natoque@Sedmolestie.edu,Zimbabwe,1,37.642000,56039.49793,12301.456790,360419.0988,31491.41457
497,Pearl,penatibus.et@massanonante.com,Philippines,1,53.943497,68888.77805,10611.606860,764531.3203,64147.28888
498,Nell,Quisque.varius@arcuVivamussit.net,Botswana,1,59.160509,49811.99062,14013.034510,337826.6382,45442.15353
499,Marla,Camaron.marla@hotmail.com,marlal,1,46.731152,61370.67766,9391.341628,462946.4924,45107.22566

--Checking the null values

In [44]:
df.isnull().sum()

Customer Name          0
Customer e-mail        0
Country                0
Gender                 0
Age                    0
Annual Salary          0
Credit Card Debt       0
Net Worth              0
Car Purchase Amount    0
dtype: int64

In [45]:
df.dtypes

Customer Name           object
Customer e-mail         object
Country                 object
Gender                   int64
Age                    float64
Annual Salary          float64
Credit Card Debt       float64
Net Worth              float64
Car Purchase Amount    float64
dtype: object

--Dropping the unwanted columns

In [46]:
df=df.drop(['Customer Name','Customer e-mail','Country'],axis=1)
df

,Gender,Age,Annual Salary,Credit Card Debt,Net Worth,Car Purchase Amount
0,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248
...,...,...,...,...,...,...
495,0,41.462515,71942.40291,6995.902524,541670.1016,48901.44342
496,1,37.642000,56039.49793,12301.456790,360419.0988,31491.41457
497,1,53.943497,68888.77805,10611.606860,764531.3203,64147.28888
498,1,59.160509,49811.99062,14013.034510,337826.6382,45442.15353
499,1,46.731152,61370.67766,9391.341628,462946.4924,45107.22566

In [ ]:
#Car purchasing column is dependent and remaining are independent

In [47]:
x=df.iloc[:,:-1]
y=df.iloc[:,-1]

In [48]:
x

     Gender        Age  Annual Salary  Credit Card Debt    Net Worth
0         0  41.851720    62812.09301      11609.380910  238961.2505
1         0  40.870623    66646.89292       9572.957136  530973.9078
2         1  43.152897    53798.55112      11160.355060  638467.1773
3         1  58.271369    79370.03798      14426.164850  548599.0524
4         1  57.313749    59729.15130       5358.712177  560304.0671
..      ...        ...            ...               ...          ...
495       0  41.462515    71942.40291       6995.902524  541670.1016
496       1  37.642000    56039.49793      12301.456790  360419.0988
497       1  53.943497    68888.77805      10611.606860  764531.3203
498       1  59.160509    49811.99062      14013.034510  337826.6382
499       1  46.731152    61370.67766       9391.341628  462946.4924

[500 rows x 5 columns]

In [49]:
y

0      35321.45877
1      45115.52566
2      42925.70921
3      67422.36313
4      55915.46248
          ...
495    48901.44342
496    31491.41457
497    64147.28888
498    45442.15353
499    45107.22566
Name: Car Purchase Amount, Length: 500, dtype: float64

In [50]:
import sklearn

In [51]:
from sklearn.model_selection import train_test_split

In [52]:
x_train,x_test,y_train,y_test=train_test_split(x,y, test_size=0.20, random_state=42)

In [53]:
x_train.shape

(400, 5)

In [54]:
x_test.shape

(100, 5)

--Fit the data to linear regression

In [55]:
from sklearn.linear_model import LinearRegression

In [56]:
reg=LinearRegression()

In [57]:
reg.fit(x_train,y_train)

LinearRegression()

--y=m1x1+m2x2+m3x3+c

In [58]:
reg.intercept_

-42147.06691230478

In [59]:
reg.coef_

array([-1.21790639e-01,  8.41561911e+02,  5.62334278e-01, -2.39425507e-05,
        2.89834812e-02])

finding the accuracy of training part

In [60]:
y_train_pred=reg.predict(x_train)

In [61]:
x_pred=pd.DataFrame({'Actual Points':y_train ,'Predicted Points':y_train_pred})

In [62]:
x_pred

     Actual Points  Predicted Points
249    46135.27233      46134.020793
433    29519.56184      29518.115802
19     54827.52403      54828.261749
322    59625.02618      59621.668325
332    25252.93221      25252.094237
..             ...               ...
106    34803.82395      34802.277854
270    12536.93842      12538.410940
348    49348.88394      49345.678391
435    42139.64528      42138.727533
102    33640.73697      33637.767173

[400 rows x 2 columns]

In [64]:
from sklearn.metrics import r2_score

In [65]:
r2_score(y_train,y_train_pred)

0.9999999812764105

In [66]:
y_test_pred=reg.predict(x_test)

In [68]:
pd.DataFrame({'test_predicted_values':y_test_pred, 'test_values':y_test})

     test_predicted_values  test_values
361           46084.577864  46082.80993
73            45060.424126  45058.89690
374           63081.568261  63079.84329
155           31838.294520  31837.22537
104           60460.967913  60461.24268
..                     ...          ...
347           49081.680349  49079.29461
86            45168.189832  45167.32542
75            50956.812832  50958.08115
438           43897.692922  43898.27330
15            53014.623979  53017.26723

[100 rows x 2 columns]

In [69]:
r2_score(y_test,y_test_pred)

0.9999999806028682